ablehobo/anduril2-plus/arch/dfp/avrdd/avrasm/inc/AVR128DA64def.inc
.equ TCB0_CTRLA = 0x0B00                 ; Control A
.equ TCB0_CTRLB = 0x0B01                 ; Control Register B
.equ TCB0_EVCTRL = 0x0B04                ; Event Control
.equ TCB0_INTCTRL = 0x0B05               ; Interrupt Control
.equ TCB0_INTFLAGS = 0x0B06              ; Interrupt Flags
.equ TCB0_STATUS = 0x0B07                ; Status
.equ TCB0_DBGCTRL = 0x0B08               ; Debug Control
.equ TCB0_TEMP = 0x0B09                  ; Temporary Value
.equ TCB0_CNT = 0x0B0A                   ; Count
.equ TCB0_CNTL = 0x0B0A                  ; Count low byte
.equ TCB0_CNTH = 0x0B0B                  ; Count hi byte
.equ TCB0_CCMP = 0x0B0C                  ; Compare or Capture
.equ TCB0_CCMPL = 0x0B0C                 ; Compare or Capture low byte
.equ TCB0_CCMPH = 0x0B0D                 ; Compare or Capture hi byte

;*************************************************************************
;** TCB1 - 16-bit Timer Type B
;*************************************************************************

.equ TCB1_CTRLA = 0x0B10                 ; Control A
.equ TCB1_CTRLB = 0x0B11                 ; Control Register B
.equ TCB1_EVCTRL = 0x0B14                ; Event Control
.equ TCB1_INTCTRL = 0x0B15               ; Interrupt Control
.equ TCB1_INTFLAGS = 0x0B16              ; Interrupt Flags
.equ TCB1_STATUS = 0x0B17                ; Status
.equ TCB1_DBGCTRL = 0x0B18               ; Debug Control
.equ TCB1_TEMP = 0x0B19                  ; Temporary Value
.equ TCB1_CNT = 0x0B1A                   ; Count
.equ TCB1_CNTL = 0x0B1A                  ; Count low byte
.equ TCB1_CNTH = 0x0B1B                  ; Count hi byte
.equ TCB1_CCMP = 0x0B1C                  ; Compare or Capture
.equ TCB1_CCMPL = 0x0B1C                 ; Compare or Capture low byte
.equ TCB1_CCMPH = 0x0B1D                 ; Compare or Capture hi byte

;*************************************************************************
;** TCB2 - 16-bit Timer Type B
;*************************************************************************

.equ TCB2_CTRLA = 0x0B20                 ; Control A
.equ TCB2_CTRLB = 0x0B21                 ; Control Register B
.equ TCB2_EVCTRL = 0x0B24                ; Event Control
.equ TCB2_INTCTRL = 0x0B25               ; Interrupt Control
.equ TCB2_INTFLAGS = 0x0B26              ; Interrupt Flags
.equ TCB2_STATUS = 0x0B27                ; Status
.equ TCB2_DBGCTRL = 0x0B28               ; Debug Control
.equ TCB2_TEMP = 0x0B29                  ; Temporary Value
.equ TCB2_CNT = 0x0B2A                   ; Count
.equ TCB2_CNTL = 0x0B2A                  ; Count low byte
.equ TCB2_CNTH = 0x0B2B                  ; Count hi byte
.equ TCB2_CCMP = 0x0B2C                  ; Compare or Capture
.equ TCB2_CCMPL = 0x0B2C                 ; Compare or Capture low byte
.equ TCB2_CCMPH = 0x0B2D                 ; Compare or Capture hi byte

;*************************************************************************
;** TCB3 - 16-bit Timer Type B
;*************************************************************************

.equ TCB3_CTRLA = 0x0B30                 ; Control A
.equ TCB3_CTRLB = 0x0B31                 ; Control Register B
.equ TCB3_EVCTRL = 0x0B34                ; Event Control
.equ TCB3_INTCTRL = 0x0B35               ; Interrupt Control
.equ TCB3_INTFLAGS = 0x0B36              ; Interrupt Flags
.equ TCB3_STATUS = 0x0B37                ; Status
.equ TCB3_DBGCTRL = 0x0B38               ; Debug Control
.equ TCB3_TEMP = 0x0B39                  ; Temporary Value
.equ TCB3_CNT = 0x0B3A                   ; Count
.equ TCB3_CNTL = 0x0B3A                  ; Count low byte
.equ TCB3_CNTH = 0x0B3B                  ; Count hi byte
.equ TCB3_CCMP = 0x0B3C                  ; Compare or Capture
.equ TCB3_CCMPL = 0x0B3C                 ; Compare or Capture low byte
.equ TCB3_CCMPH = 0x0B3D                 ; Compare or Capture hi byte

;*************************************************************************
;** TCB4 - 16-bit Timer Type B
;*************************************************************************

.equ TCB4_CTRLA = 0x0B40                 ; Control A
.equ TCB4_CTRLB = 0x0B41                 ; Control Register B
.equ TCB4_EVCTRL = 0x0B44                ; Event Control
.equ TCB4_INTCTRL = 0x0B45               ; Interrupt Control
.equ TCB4_INTFLAGS = 0x0B46              ; Interrupt Flags
.equ TCB4_STATUS = 0x0B47                ; Status
.equ TCB4_DBGCTRL = 0x0B48               ; Debug Control
.equ TCB4_TEMP = 0x0B49                  ; Temporary Value
.equ TCB4_CNT = 0x0B4A                   ; Count
.equ TCB4_CNTL = 0x0B4A                  ; Count low byte
.equ TCB4_CNTH = 0x0B4B                  ; Count hi byte
.equ TCB4_CCMP = 0x0B4C                  ; Compare or Capture
.equ TCB4_CCMPL = 0x0B4C                 ; Compare or Capture low byte
.equ TCB4_CCMPH = 0x0B4D                 ; Compare or Capture hi byte

;*************************************************************************
;** TCD0 - Timer Counter D
;*************************************************************************

.equ TCD0_CTRLA = 0x0B80                 ; Control A
.equ TCD0_CTRLB = 0x0B81                 ; Control B
.equ TCD0_CTRLC = 0x0B82                 ; Control C
.equ TCD0_CTRLD = 0x0B83                 ; Control D
.equ TCD0_CTRLE = 0x0B84                 ; Control E
.equ TCD0_EVCTRLA = 0x0B88               ; EVCTRLA
.equ TCD0_EVCTRLB = 0x0B89               ; EVCTRLB
.equ TCD0_INTCTRL = 0x0B8C               ; Interrupt Control
.equ TCD0_INTFLAGS = 0x0B8D              ; Interrupt Flags
.equ TCD0_STATUS = 0x0B8E                ; Status
.equ TCD0_INPUTCTRLA = 0x0B90            ; Input Control A
.equ TCD0_INPUTCTRLB = 0x0B91            ; Input Control B
.equ TCD0_FAULTCTRL = 0x0B92             ; Fault Control
.equ TCD0_DLYCTRL = 0x0B94               ; Delay Control
.equ TCD0_DLYVAL = 0x0B95                ; Delay value
.equ TCD0_DITCTRL = 0x0B98               ; Dither Control A
.equ TCD0_DITVAL = 0x0B99                ; Dither value
.equ TCD0_DBGCTRL = 0x0B9E               ; Debug Control
.equ TCD0_CAPTUREA = 0x0BA2              ; Capture A
.equ TCD0_CAPTUREAL = 0x0BA2             ; Capture A low byte
.equ TCD0_CAPTUREAH = 0x0BA3             ; Capture A hi byte
.equ TCD0_CAPTUREB = 0x0BA4              ; Capture B
.equ TCD0_CAPTUREBL = 0x0BA4             ; Capture B low byte
.equ TCD0_CAPTUREBH = 0x0BA5             ; Capture B hi byte
.equ TCD0_CMPASET = 0x0BA8               ; Compare A Set
.equ TCD0_CMPASETL = 0x0BA8              ; Compare A Set low byte
.equ TCD0_CMPASETH = 0x0BA9              ; Compare A Set hi byte
.equ TCD0_CMPACLR = 0x0BAA               ; Compare A Clear
.equ TCD0_CMPACLRL = 0x0BAA              ; Compare A Clear low byte
.equ TCD0_CMPACLRH = 0x0BAB              ; Compare A Clear hi byte
.equ TCD0_CMPBSET = 0x0BAC               ; Compare B Set
.equ TCD0_CMPBSETL = 0x0BAC              ; Compare B Set low byte
.equ TCD0_CMPBSETH = 0x0BAD              ; Compare B Set hi byte
.equ TCD0_CMPBCLR = 0x0BAE               ; Compare B Clear
.equ TCD0_CMPBCLRL = 0x0BAE              ; Compare B Clear low byte
.equ TCD0_CMPBCLRH = 0x0BAF              ; Compare B Clear hi byte

;*************************************************************************
;** TWI0 - Two-Wire Interface
;*************************************************************************

.equ TWI0_CTRLA = 0x0900                 ; Control A
.equ TWI0_DUALCTRL = 0x0901              ; Dual Control
.equ TWI0_DBGCTRL = 0x0902               ; Debug Control Register
.equ TWI0_MCTRLA = 0x0903                ; Host Control A
.equ TWI0_MCTRLB = 0x0904                ; Host Control B
.equ TWI0_MSTATUS = 0x0905               ; Host Status
.equ TWI0_MBAUD = 0x0906                 ; Host Baud Rate Control
.equ TWI0_MADDR = 0x0907                 ; Host Address
.equ TWI0_MDATA = 0x0908                 ; Host Data
.equ TWI0_SCTRLA = 0x0909                ; Client Control A
.equ TWI0_SCTRLB = 0x090A                ; Client Control B
.equ TWI0_SSTATUS = 0x090B               ; Client Status
.equ TWI0_SADDR = 0x090C                 ; Client Address
.equ TWI0_SDATA = 0x090D                 ; Client Data
.equ TWI0_SADDRMASK = 0x090E             ; Client Address Mask

;*************************************************************************
;** TWI1 - Two-Wire Interface
;*************************************************************************

.equ TWI1_CTRLA = 0x0920                 ; Control A
.equ TWI1_DUALCTRL = 0x0921              ; Dual Control
.equ TWI1_DBGCTRL = 0x0922               ; Debug Control Register
.equ TWI1_MCTRLA = 0x0923                ; Host Control A
.equ TWI1_MCTRLB = 0x0924                ; Host Control B
.equ TWI1_MSTATUS = 0x0925               ; Host Status
.equ TWI1_MBAUD = 0x0926                 ; Host Baud Rate Control
.equ TWI1_MADDR = 0x0927                 ; Host Address
.equ TWI1_MDATA = 0x0928                 ; Host Data
.equ TWI1_SCTRLA = 0x0929                ; Client Control A
.equ TWI1_SCTRLB = 0x092A                ; Client Control B
.equ TWI1_SSTATUS = 0x092B               ; Client Status
.equ TWI1_SADDR = 0x092C                 ; Client Address
.equ TWI1_SDATA = 0x092D                 ; Client Data
.equ TWI1_SADDRMASK = 0x092E             ; Client Address Mask

;*************************************************************************
;** USART0 - Universal Synchronous and Asynchronous Receiver and Transmitter
;*************************************************************************

.equ USART0_RXDATAL = 0x0800             ; Receive Data Low Byte
.equ USART0_RXDATAH = 0x0801             ; Receive Data High Byte
.equ USART0_TXDATAL = 0x0802             ; Transmit Data Low Byte
.equ USART0_TXDATAH = 0x0803             ; Transmit Data High Byte
.equ USART0_STATUS = 0x0804              ; Status
.equ USART0_CTRLA = 0x0805               ; Control A
.equ USART0_CTRLB = 0x0806               ; Control B
.equ USART0_CTRLC = 0x0807               ; Control C
.equ USART0_BAUD = 0x0808                ; Baud Rate
.equ USART0_BAUDL = 0x0808               ; Baud Rate low byte
.equ USART0_BAUDH = 0x0809               ; Baud Rate hi byte
.equ USART0_CTRLD = 0x080A               ; Control D
.equ USART0_DBGCTRL = 0x080B             ; Debug Control
.equ USART0_EVCTRL = 0x080C              ; Event Control
.equ USART0_TXPLCTRL = 0x080D            ; IRCOM Transmitter Pulse Length Control
.equ USART0_RXPLCTRL = 0x080E            ; IRCOM Receiver Pulse Length Control

;*************************************************************************
;** USART1 - Universal Synchronous and Asynchronous Receiver and Transmitter
;*************************************************************************

.equ USART1_RXDATAL = 0x0820             ; Receive Data Low Byte
.equ USART1_RXDATAH = 0x0821             ; Receive Data High Byte
.equ USART1_TXDATAL = 0x0822             ; Transmit Data Low Byte
.equ USART1_TXDATAH = 0x0823             ; Transmit Data High Byte
.equ USART1_STATUS = 0x0824              ; Status
.equ USART1_CTRLA = 0x0825               ; Control A
.equ USART1_CTRLB = 0x0826               ; Control B
.equ USART1_CTRLC = 0x0827               ; Control C
.equ USART1_BAUD = 0x0828                ; Baud Rate
.equ USART1_BAUDL = 0x0828               ; Baud Rate low byte
.equ USART1_BAUDH = 0x0829               ; Baud Rate hi byte
.equ USART1_CTRLD = 0x082A               ; Control D
.equ USART1_DBGCTRL = 0x082B             ; Debug Control
.equ USART1_EVCTRL = 0x082C              ; Event Control
.equ USART1_TXPLCTRL = 0x082D            ; IRCOM Transmitter Pulse Length Control
.equ USART1_RXPLCTRL = 0x082E            ; IRCOM Receiver Pulse Length Control

;*************************************************************************
;** USART2 - Universal Synchronous and Asynchronous Receiver and Transmitter
;*************************************************************************

.equ USART2_RXDATAL = 0x0840             ; Receive Data Low Byte
.equ USART2_RXDATAH = 0x0841             ; Receive Data High Byte
.equ USART2_TXDATAL = 0x0842             ; Transmit Data Low Byte
.equ USART2_TXDATAH = 0x0843             ; Transmit Data High Byte
.equ USART2_STATUS = 0x0844              ; Status
.equ USART2_CTRLA = 0x0845               ; Control A
.equ USART2_CTRLB = 0x0846               ; Control B
.equ USART2_CTRLC = 0x0847               ; Control C
.equ USART2_BAUD = 0x0848                ; Baud Rate
.equ USART2_BAUDL = 0x0848               ; Baud Rate low byte
.equ USART2_BAUDH = 0x0849               ; Baud Rate hi byte
.equ USART2_CTRLD = 0x084A               ; Control D
.equ USART2_DBGCTRL = 0x084B             ; Debug Control
.equ USART2_EVCTRL = 0x084C              ; Event Control
.equ USART2_TXPLCTRL = 0x084D            ; IRCOM Transmitter Pulse Length Control
.equ USART2_RXPLCTRL = 0x084E            ; IRCOM Receiver Pulse Length Control

;*************************************************************************
;** USART3 - Universal Synchronous and Asynchronous Receiver and Transmitter
;*************************************************************************

.equ USART3_RXDATAL = 0x0860             ; Receive Data Low Byte
.equ USART3_RXDATAH = 0x0861             ; Receive Data High Byte
.equ USART3_TXDATAL = 0x0862             ; Transmit Data Low Byte
.equ USART3_TXDATAH = 0x0863             ; Transmit Data High Byte
.equ USART3_STATUS = 0x0864              ; Status
.equ USART3_CTRLA = 0x0865               ; Control A
.equ USART3_CTRLB = 0x0866               ; Control B
.equ USART3_CTRLC = 0x0867               ; Control C
.equ USART3_BAUD = 0x0868                ; Baud Rate
.equ USART3_BAUDL = 0x0868               ; Baud Rate low byte
.equ USART3_BAUDH = 0x0869               ; Baud Rate hi byte
.equ USART3_CTRLD = 0x086A               ; Control D
.equ USART3_DBGCTRL = 0x086B             ; Debug Control
.equ USART3_EVCTRL = 0x086C              ; Event Control
.equ USART3_TXPLCTRL = 0x086D            ; IRCOM Transmitter Pulse Length Control
.equ USART3_RXPLCTRL = 0x086E            ; IRCOM Receiver Pulse Length Control

;*************************************************************************
;** USART4 - Universal Synchronous and Asynchronous Receiver and Transmitter
;*************************************************************************

.equ USART4_RXDATAL = 0x0880             ; Receive Data Low Byte
.equ USART4_RXDATAH = 0x0881             ; Receive Data High Byte
.equ USART4_TXDATAL = 0x0882             ; Transmit Data Low Byte
.equ USART4_TXDATAH = 0x0883             ; Transmit Data High Byte
.equ USART4_STATUS = 0x0884              ; Status
.equ USART4_CTRLA = 0x0885               ; Control A
.equ USART4_CTRLB = 0x0886               ; Control B
.equ USART4_CTRLC = 0x0887               ; Control C
.equ USART4_BAUD = 0x0888                ; Baud Rate
.equ USART4_BAUDL = 0x0888               ; Baud Rate low byte
.equ USART4_BAUDH = 0x0889               ; Baud Rate hi byte
.equ USART4_CTRLD = 0x088A               ; Control D
.equ USART4_DBGCTRL = 0x088B             ; Debug Control
.equ USART4_EVCTRL = 0x088C              ; Event Control
.equ USART4_TXPLCTRL = 0x088D            ; IRCOM Transmitter Pulse Length Control
.equ USART4_RXPLCTRL = 0x088E            ; IRCOM Receiver Pulse Length Control

;*************************************************************************
;** USART5 - Universal Synchronous and Asynchronous Receiver and Transmitter
;*************************************************************************

